{
    "data":{
       "about":"I'm CJ, Professor of Real Estate at Schack Institute and a Founder of NOYACK, a financial education company impacting the lives of young investors everywhere through financial education, community and universal access to private markets.\n\nI am the son of Italian immigrants,  my father a highly decorated NYFD Fireman who then built one of the largest municipal building companies in New York City. Nancy Reagan gave him an award for his projects. At 16 my father had a stroke and I gave up my dream of playing in the NHL (yeah, right) to manage the family business which I knew nothing about.\n\nThat started a 40 year journey of educating myself through thousands of hours of reading and painful mistakes. But it also turned out to be my life's mission and I wish everyone finds they're purpose and is able to pusue it . I am doing this as a financial educator of young investors after a pretty successful career as the Chief Investment Officer of a nine family investing syndicate; my track record over 30 years doing this is  23% average annual returns.  We invested in: commercial real estate, media IP,  early stage venture capital, private credit, fine art and consumer packaged goods. \n\nThe COVID pandemic was a wake up call  for me to create a more lasting legacy than just money; helping others by providing so I founded NOYACK to educate and mentor  Millennials & Gen Z as they inherit are inheriting $4.4 trillion by 2025 and $39.4 trillion by 2045 - The Great Wealth Transfer How will they make decisions for their future? NOYACK's mission is all about creating a new kind of next-gen investment culture, bringing people together in a community space for young investors to learn, explore, and invest in private markets. \n\nNOYACK and our Noyack Private Investing Club  is becoming a hub, a home, a safe space to learn, interact and access this valuable world of private markets.\n\nI built this for the 19 year old me, CJ, who had no one to ask for help or any place to learn about private investments or a community of like-minded investors and peers with similar interests at a similar place in their lives. My goal is to teach members to fish for themselves so they can build generational wealth. Whether they’re looking to make a small investment or have just inherited a family nest egg they need to protect - we’re here to transform their lives, their kid’s lives and if all goes as planned, their kid’s kid’s lives.\n\nCome join the wealth revolution to end economic inequality - we don't have to do this, we are lucky enough to get to be able to do this. #AccessGranted",
       "certifications":[
          
       ],
       "city":"New York",
       "company":"NYU Schack Institute of Real Estate",
       "company_domain":"sps.nyu.edu",
       "company_employee_range":"51 - 200",
       "company_industry":"Higher Education",
       "company_linkedin_url":"https://www.linkedin.com/school/nyuschack/",
       "company_logo_url":"https://media.licdn.com/dms/image/D4E0BAQHmAl7S-DjtKw/company-logo_400_400/0/1689884074014/nyuschack_logo?e=1725494400&v=beta&t=z9a82rSQs9W07JmMcdNtKqhE95LvVgVIRXJ5dpBduLQ",
       "company_website":"http://www.sps.nyu.edu/schack",
       "company_year_founded":1967,
       "connections_count":500,
       "country":"United States",
       "current_company_join_month":4,
       "current_company_join_year":2024,
       "educations":[
          {
             "activities":"",
             "date_range":"",
             "degree":"Executive Management Program",
             "description":"",
             "eduId":98366433,
             "end_month":"",
             "end_year":"",
             "field_of_study":"",
             "grade":"",
             "school":"Harvard Business School",
             "school_id":"4867",
             "school_linkedin_url":"https://www.linkedin.com/company/4867/",
             "start_month":"",
             "start_year":""
          },
          {
             "activities":"",
             "date_range":"",
             "degree":"GC",
             "description":"",
             "eduId":22899893,
             "end_month":"",
             "end_year":"",
             "field_of_study":"Game Theory And Econometrics",
             "grade":"",
             "school":"London School of Economics and Political Science",
             "school_id":"6544",
             "school_linkedin_url":"https://www.linkedin.com/company/6544/",
             "start_month":"",
             "start_year":""
          },
          {
             "activities":"",
             "date_range":"",
             "degree":"Bachelor of Science (BS)",
             "description":"",
             "eduId":112529037,
             "end_month":"",
             "end_year":"",
             "field_of_study":"Mathematical Statistics and Probability",
             "grade":"",
             "school":"Tufts University",
             "school_id":"157341",
             "school_linkedin_url":"https://www.linkedin.com/company/157341/",
             "start_month":"",
             "start_year":""
          },
          {
             "activities":"",
             "date_range":"",
             "degree":"",
             "description":"",
             "eduId":165965205,
             "end_month":"",
             "end_year":"",
             "field_of_study":"Classics and Classical Languages, Literatures, and Linguistics",
             "grade":"",
             "school":"Fordham Preparatory",
             "school_id":"",
             "school_linkedin_url":"",
             "start_month":"",
             "start_year":""
          }
       ],
       "email":"",
       "experiences":[
          {
             "company":"NYU Schack Institute of Real Estate",
             "company_id":"11128202",
             "company_linkedin_url":"https://www.linkedin.com/company/11128202",
             "company_public_url":"https://www.linkedin.com/school/nyuschack/",
             "current_company_join_month":4,
             "current_company_join_year":2024,
             "date_range":"Apr 2024 - present",
             "description":"I teach in the NYU Masters Program specifically about Real Estate Investment Trusts, Financing and Investment",
             "duration":"3 mos",
             "end_month":"",
             "end_year":"",
             "is_current":true,
             "location":"New York City Metropolitan Area",
             "start_month":4,
             "start_year":2024,
             "title":"Professor of Real Estate"
          },
          {
             "company":"Noyack Capital",
             "company_id":"",
             "company_linkedin_url":"",
             "company_public_url":null,
             "date_range":"1988 - present",
             "description":"I am the  Chief Investment Officer of a nine UNHW family alternative investment allocator. NOYACK allocated to  commercial real estate, seed VC, consumer packaged goods, and opportunistic special situations.",
             "duration":"36 yrs 6 mos",
             "end_month":"",
             "end_year":"",
             "is_current":true,
             "location":"New York City Metropolitan Area",
             "start_month":"",
             "start_year":1988,
             "title":"Chief Investment Officer of MultiFamily Office"
          },
          {
             "company":"NOYACK Wealth Club",
             "company_id":"321778",
             "company_linkedin_url":"https://www.linkedin.com/company/321778",
             "company_public_url":"https://www.linkedin.com/company/wearenoyack",
             "date_range":"2022 - present",
             "description":"NOYACK (weareNOYACK.com)is a fast-growing financial education startup that is the only membership club for Millennial, Gen Z, Gen Alpha learn, interact, and invest in private markets.\nNOYACK provides online masterclasses, live events, mentorship, research and private investment offeringssimilar to those reserved for sovereign wealth institutions and billionaires. NOYACK is creating a massive impact through financial literacy educating the future inheritors of The Great Wealth Transfer - $42 trillion by 2040 - the largest wealth transfer in the history of our planet. NOYACK launched only 4 months ago and already built an audience of over 300K strong!   Education, community and access is our product | integrity, innovation, transparency, and inclusivity are our beliefs.\n-that's what we believe in, that's who we are. We are NOYACK...and so are you. #AccessGranted",
             "duration":"2 yrs 6 mos",
             "end_month":"",
             "end_year":"",
             "is_current":true,
             "location":"NYC",
             "start_month":"",
             "start_year":2022,
             "title":"Founder & CEO"
          },
          {
             "company":"Noyack Alternative Investments",
             "company_id":"100329260",
             "company_linkedin_url":"https://www.linkedin.com/company/100329260",
             "company_public_url":null,
             "date_range":"2022 - present",
             "description":"NOYACK is revolutionizing self-directed wealth management  by making world-class private investments accessible to all investors, not just the institutions. At our core is a commitment to financial education and technological innovation, empowering individuals with the knowledge to invest like billionaires. It’s not about quick returns or cashing out. It’s about making smart financial decisions for your future. Our goal is to teach members to fish for themselves so they can build generational wealth. Whether they’re looking to make a small investment or have just inherited a family nest egg they need to protect - we’re here to transform their lives, their kid’s lives and if all goes as planned, their kid’s kid’s lives.\nNOYACK is all about creating a new kind of wealth management culture; one that doesn't lead with transaction but brings people together in a community space for young investors to learn, connect and generate wealth through private investing. Financial literacy AND access as social impact. We want to open up that door and give access to the powerful world of Private Investments.\n\nCome with us, to the room where it all happens. \n\nWe are Noyack.\nAnd so are you.  \nAccessGranted.™",
             "duration":"2 yrs 6 mos",
             "end_month":"",
             "end_year":"",
             "is_current":true,
             "location":"New York City Metropolitan Area",
             "start_month":"",
             "start_year":2022,
             "title":"Managing Partner & Chief Investment Officer"
          },
          {
             "company":"SpaceX",
             "company_id":"30846",
             "company_linkedin_url":"https://www.linkedin.com/company/30846",
             "company_public_url":"https://www.linkedin.com/company/spacex",
             "date_range":"2020 - present",
             "description":"",
             "duration":"4 yrs 6 mos",
             "end_month":"",
             "end_year":"",
             "is_current":true,
             "location":"Hawthorne, California, United States",
             "start_month":"",
             "start_year":2020,
             "title":"Seed Investor"
          },
          {
             "company":"Nalu Bio ",
             "company_id":"37248677",
             "company_linkedin_url":"https://www.linkedin.com/company/37248677",
             "company_public_url":"https://www.linkedin.com/company/nalu-bio",
             "date_range":"Jan 2021 - present",
             "description":"",
             "duration":"3 yrs 6 mos",
             "end_month":"",
             "end_year":"",
             "is_current":true,
             "location":"New York City Metropolitan Area",
             "start_month":1,
             "start_year":2021,
             "title":"Pre-Seed Investor"
          },
          {
             "company":"Golden Seeds",
             "company_id":"313031",
             "company_linkedin_url":"https://www.linkedin.com/company/313031",
             "company_public_url":"https://www.linkedin.com/company/goldenseeds",
             "date_range":"2019 - present",
             "description":"50% of the U.S. population are women. 42% of entrepreneurial ventures are women-owned. Since our founding in 2005, we have been propelled to identify promising women entrepreneurs, to support their growth, and to better align these ratios to create value through the breakthrough ideas and tenaciousness of women entrepreneurs. Women are starting businesses at record levels, with the ideas, skills and talents to build great companies.  Golden Seeds, one of the nation’s largest and most active early-stage investment groups, focuses squarely on female founders. Our investment thesis rests on extensive research with a compelling conclusion: gender diverse teams produce better return on equity. By seeking companies where women hold leadership positions and own substantial equity, we fund companies likely to have diverse perspectives that will contribute to ultimate success.\nGolden Seeds members have invested over $140 million in over 200 exciting women-led companies … and counting. Headquartered in New York City, Golden Seeds has chapters in Arizona, Atlanta, Boston, Dallas, Houston, New Jersey, New York and Silicon Valley",
             "duration":"5 yrs 6 mos",
             "end_month":"",
             "end_year":"",
             "is_current":true,
             "location":"New York City Metropolitan Area",
             "start_month":"",
             "start_year":2019,
             "title":"Early Stage Investor"
          },
          {
             "company":"IMMINENT",
             "company_id":"6609201",
             "company_linkedin_url":"https://www.linkedin.com/company/6609201",
             "company_public_url":null,
             "date_range":"2014 - 2019",
             "description":"SUCCESSFUL 7X EXIT FOR OUR INVESTORS! \n\nWe have a big idea - an operating system with everything you need in one place to get your employees more engaged. We believe workforce productivity begins with purpose.\n\nSo it is our mission to create technology and content that harnesses employees' passion for doing good while also providing them with resources they need to stay healthy. Finally, we want to support employees by providing them the information that they need as well as a social environment where they can be heard.\n\nIntroducing OAHU- IMMINENT's holistic approach to workforce wellbeing. Giving  + Habitat + Wellbeing + Social = Inspired.  We assist Fortune 1000 companies & brands to achieve amazing workforce goals by treating their employees as their first customers.\nEmployee360™ is a simple, yet powerful employee engagement portal that streamlines the onboarding process to engage employees and galvanize their passion to get involved. We provide state-of-the-art software tools to improve bi-directional workplace communication. We identify social impact movements, successful non-profits or non-governmental organizations around which to create holistic CSR campaigns. And we produce or curate employee-created video stories, immersive or full VR, that enable progressive brands to build truly authentic relationships with their employees and customers alike. \n\nFinally, our integrated social toolkit enables the marketing department to distribute the original content or their curated employee stories to a highly targeted audience informed by proprietary data insights. \n\nHappiness, productivity, volunteering, sharing... that’s why we feel IMMINENT offers a better way for companies to achieve 360-degree wellbeing. That’s what we believe in. That’s what drives us. That’s our cause.\n \nIn the world of doing good, the future is IMMINENT.",
             "duration":"5 yrs",
             "end_month":"",
             "end_year":2019,
             "is_current":false,
             "location":"United States",
             "start_month":"",
             "start_year":2014,
             "title":"Founder & CEO"
          },
          {
             "company":"Economic Innovation Group",
             "company_id":"9357069",
             "company_linkedin_url":"https://www.linkedin.com/company/9357069",
             "company_public_url":"https://www.linkedin.com/company/economicinnovationgroup",
             "date_range":"2016 - 2018",
             "description":"Founded by Sean Parker, John Lettieri, and Steve Glickman, EIG is a bipartisan public policy organization that combines innovative research and data-driven advocacy to address America’s most pressing economic challenges. From our headquarters in the nation’s capital, EIG convenes leading experts from the public and private sectors, develops original research, and advances creative policy proposals that bring new jobs, investment, and economic dynamism to U.S. communities.",
             "duration":"2 yrs",
             "end_month":"",
             "end_year":2018,
             "is_current":false,
             "location":"Washington D.C. Metro Area",
             "start_month":"",
             "start_year":2016,
             "title":"Member Of The Board Of Advisors"
          },
          {
             "company":"Ten Paces Media",
             "company_id":"1948038",
             "company_linkedin_url":"https://www.linkedin.com/company/1948038",
             "company_public_url":null,
             "date_range":"1994 - 2015",
             "description":"Oscar-winning producer (Slingblade) and head of studios. Builder and investor in physical  studio infrastructure as well as SVOD, immersive video (VR/AR/360°). Created subsidiary to build content IP library & publishing.",
             "duration":"21 yrs",
             "end_month":"",
             "end_year":2015,
             "is_current":false,
             "location":"NYC",
             "start_month":"",
             "start_year":1994,
             "title":"Executive Producer"
          },
          {
             "company":"Gun For Hire Digital Studios",
             "company_id":"",
             "company_linkedin_url":"",
             "company_public_url":null,
             "date_range":"1997 - 2003",
             "description":"Mr. Follini served as CEO of the Gun For Hire Media Studios, the largest digital production facility in New York from 1996 - 2001. He conceived, designed, and supervised construction of all of Gun For Hire’s 400,000+ square feet of digital media centers in New York, Miami, Vancouver, Toronto and Los Angeles. His New York facility earned the 1998 Crain’s Magazine Small Business Award.",
             "duration":"6 yrs",
             "end_month":"",
             "end_year":2003,
             "is_current":false,
             "location":"NYC, Miami, Toronto, Vancouver, Los Angeles",
             "start_month":"",
             "start_year":1997,
             "title":"CEO"
          },
          {
             "company":"Shooting Gallery Films",
             "company_id":"",
             "company_linkedin_url":"",
             "company_public_url":null,
             "date_range":"Sep 1993 - 2003",
             "description":"Producer of several award-winning films & digital media content",
             "duration":"9 yrs 5 mos",
             "end_month":"",
             "end_year":2003,
             "is_current":false,
             "location":"NYC",
             "start_month":9,
             "start_year":1993,
             "title":"Principle & Oscar-winning Producer"
          },
          {
             "company":"Blackstone",
             "company_id":"7834",
             "company_linkedin_url":"https://www.linkedin.com/company/7834",
             "company_public_url":"https://www.linkedin.com/company/blackstonegroup",
             "date_range":"1988 - 1993",
             "description":"",
             "duration":"5 yrs",
             "end_month":"",
             "end_year":1993,
             "is_current":false,
             "location":"New York City Metropolitan Area",
             "start_month":"",
             "start_year":1988,
             "title":"Associate"
          }
       ],
       "first_name":"CJ",
       "followers_count":14713,
       "full_name":"CJ Follini",
       "headline":"NYU Professor of Real estate | CIO & Multi-Family Office Allocator |  #AlternativeInvestment Expert | Board Member | Publisher of #1 Subscribed Newsletter | #FinancialEducation Nonprofit | Public Speaker | Proud dad",
       "hq_city":"New York",
       "hq_country":"US",
       "hq_region":"NY",
       "job_title":"Professor of Real Estate",
       "languages":"Italian, Spanish",
       "last_name":"Follini",
       "linkedin_url":"https://www.linkedin.com/in/cjfollini",
       "location":"New York, New York, United States",
       "phone":"",
       "profile_id":"26902278",
       "profile_image_url":"https://media.licdn.com/dms/image/D4E03AQGbJVJnATuprA/profile-displayphoto-shrink_800_800/0/1702576825399?e=1723075200&v=beta&t=gmxxi0_QBUWQaz8k9__v0ADRfdwD7PCa-2pXnSsxCqw",
       "public_id":"cjfollini",
       "school":"Harvard Business School",
       "state":"New York",
       "urn":"ACoAAAGafwYBi3pXOoVVwIyAFc453DuIv50jfTA"
    },
    "message":"ok"
 }